In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    "메뉴" : ['아메리카노','카페라떼','카페모카','카푸치노','에스프레소','밀크티','녹차'],
    "가격" : [4500,5000,5500,5000,4000,5900,5300],
    "칼로리":[10,110,250,110,20,210,0],
})

In [4]:
df.to_csv('temp.csv')

In [6]:
temp_df = pd.read_csv('temp.csv')
temp_df.head()

   Unnamed: 0     메뉴    가격  칼로리
0           0  아메리카노  4500   10
1           1   카페라떼  5000  110
2           2   카페모카  5500  250
3           3   카푸치노  5000  110
4           4  에스프레소  4000   20

In [7]:
# 아무런 옵션 없이 dataFrame을 파일로 저장했을떄, index에 대해서 Unnamed라는 컬럼명이 생기게됨.

In [10]:
df.to_csv('cafe.csv',index=False)
df = pd.read_csv('cafe.csv')
df.head()

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20

In [11]:
# SECTION 3 탐색적 데이터 분석 (EDA)

In [12]:
#데이터 샘플 확인 : 앞에서 부터 n개 (기본 5개)
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [13]:
#뒤에서 부터 n개
df.tail(3)

      메뉴    가격  칼로리
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [ ]:
df.sample(3) # 랜덤하게 3개만 출력

      메뉴    가격  칼로리
3   카푸치노  5000  110
1   카페라떼  5000  110
0  아메리카노  4500   10

In [15]:
#데이터 프레임 크기 (행, 컬럼)
df.shape

(7, 3)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [ ]:
# 상관관계
df.corr(numeric_only=True) # 숫자만 선택하겠다.

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

In [20]:
#중복값이 있는 데이터 생성
df_car = pd.DataFrame({
    "car" : ['Sedan','SUV','Sedan','SUV','SUV','SUV'],
    "size" : ['S','M','S','S','M','L']
})
df_car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [21]:
df_car.nunique()

car     2
size    3
dtype: int64

In [ ]:
#항목별 개수
print(df_car['car'].value_counts())
print(df_car['size'].value_counts())

car
SUV      4
Sedan    2
Name: count, dtype: int64
size
S    3
M    2
L    1
Name: count, dtype: int64

In [ ]:
df.describe()

                가격         칼로리
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [32]:
df_car.describe(include='O')

        car size
count     6    6
unique    2    3
top     SUV    S
freq      4    3

In [34]:
df.describe(include='O')

           메뉴
count       7
unique      7
top     아메리카노
freq        1